Белгипрозем_2017/src/Catalogs/ВизыСогласования/ВизыСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВизыСогласования</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПомещенияВИсторию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.Согласование</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоместилВИсторию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомещенаВИсторию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСогласования</name>
    <type>
      <types>EnumRef.РезультатыСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановилРезультат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/InformationRegisters/ИсполнителиЗадач/ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиЗадач</name>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/ВизыСогласования/ManagerModule.bsl
// УправлениеДоступом

// Возвращает строку, содержащую перечисление полей доступа через запятую
// Это перечисление используется в дальнейшем для передачи в метод 
// ОбщегоНазначения.ПолучитьЗначенияРеквизитов()
Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат 
		"Документ,
		|Автор,
		|Исполнитель,
		|РольИсполнителя,
		|ОсновнойОбъектАдресации,
		|ДополнительныйОбъектадресации";
	
КонецФункции

// Заполняет переданный дескриптор доступа
//
Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ДескрипторДоступа.ДескрипторВладельца = 
		РегистрыСведений.ДескрипторыДоступаДляОбъектов.НайтиДескрипторДляОбъекта(ОбъектДоступа.Документ);
		
	ДескрипторДоступа.ДобавитьПользователя(
		"Автор",
		ОбъектДоступа.Автор);	
		
	Если ЗначениеЗаполнено(ОбъектДоступа.Исполнитель) Тогда 
		Исполнитель = ОбъектДоступа.Исполнитель;
	Иначе
		Исполнитель = ОбъектДоступа.РольИсполнителя;
	КонецЕсли;	
		
	ДескрипторДоступа.ДобавитьПользователя(
		"Исполнитель",
		Исполнитель,
		ОбъектДоступа.ОсновнойОбъектАдресации,
		ОбъектДоступа.ДополнительныйОбъектАдресации);	

КонецПроцедуры

// Возвращает Истина, указывая тем самым, что этот объект сам заполняет свои права
//
Функция ЕстьМетодЗаполнитьПраваДоступа() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Заполняет параметр ПраваДоступа правами доступа, вычисляя их на
// основании переданного дескриптора доступа.
// Если указан параметр ПротоколРасчетаПрав, то в него
// заносится список данных, которые были использованы для расчета прав.
Процедура ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// права владельца
	СоответствиеПравВладельца = Новый Соответствие;
	ДокументооборотПраваДоступа.СкопироватьПраваДескриптора(ДескрипторДоступа.ДескрипторВладельца, СоответствиеПравВладельца);
	
	// права на чтение и добавление
	Для каждого Эл Из СоответствиеПравВладельца Цикл
		ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
				Эл.Значение.Чтение, Ложь, Ложь, Ложь, Ложь);
				
		ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
			ПраваДоступа,
			Эл.Ключ,
			Неопределено,
			Неопределено,
			ПраваПользователя);	
	КонецЦикла; 
	
	Если ПротоколРасчетаПрав <> Неопределено Тогда
		ПротоколРасчетаПрав.Добавить(НСтр("ru = 'По документу'"));
	КонецЕсли;
	
	// права на изменение
	Для каждого Эл Из ДескрипторДоступа.Пользователи Цикл
		
		Если ТипЗнч(Эл.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			
			НайденноеЗначение = СоответствиеПравВладельца.Получить(Эл.Пользователь);
			Если НайденноеЗначение = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			Если Эл.Ключ = "Автор" Или Эл.Ключ = "" Тогда
				
				ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
					НайденноеЗначение.Чтение, НайденноеЗначение.Добавление Или НайденноеЗначение.Изменение, НайденноеЗначение.Изменение, НайденноеЗначение.Изменение, Ложь);
				
				Если ПротоколРасчетаПрав <> Неопределено Тогда
					ПротоколРасчетаПрав.Добавить(НСтр("ru = 'Автор визы согласования'"));
				КонецЕсли;
				
			ИначеЕсли Эл.Ключ = "Исполнитель" Тогда
				
				ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
					НайденноеЗначение.Чтение, Ложь, НайденноеЗначение.Чтение, Ложь, Ложь);
				
				Если ПротоколРасчетаПрав <> Неопределено Тогда
					ПротоколРасчетаПрав.Добавить(НСтр("ru = 'Исполнитель'"));
				КонецЕсли;
				
			Иначе
				
				ВызватьИсключение НСтр("ru = 'Неизвестный ключ пользователя.'");
				
			КонецЕсли;			
			
			ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
				ПраваДоступа,
				Эл.Пользователь,
				Неопределено,
				Неопределено,
				ПраваПользователя);
			
			
		ИначеЕсли ТипЗнч(Эл.Пользователь) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
			
			ИсполнителиРоли = РегистрыСведений.ИсполнителиЗадач.ПолучитьИсполнителейРоли(Эл.Пользователь, Эл.ОсновнойОбъектАдресации, Эл.ДополнительныйОбъектАдресации);
			Для каждого ИсполнительРоли Из ИсполнителиРоли Цикл
				
				НайденноеЗначение = СоответствиеПравВладельца.Получить(ИсполнительРоли.Исполнитель);
				Если НайденноеЗначение = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если Эл.Ключ = "Исполнитель" Или Эл.Ключ = "" Тогда
				
					ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
						НайденноеЗначение.Чтение, Ложь, НайденноеЗначение.Чтение, Ложь, Ложь);
				
					Если ПротоколРасчетаПрав <> Неопределено Тогда
						ПротоколРасчетаПрав.Добавить(НСтр("ru = 'Исполнитель'"));
					КонецЕсли;
					
				Иначе
					
					ВызватьИсключение НСтр("ru = 'Неизвестный ключ пользователя.'");
					
				КонецЕсли;			
				
				ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
					ПраваДоступа,
					ИсполнительРоли.Исполнитель,
					Неопределено,
					Неопределено,
					ПраваПользователя);
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

// Конец УправлениеДоступом

// Возвращает массив имен ключевых реквизитов
Функция ПолучитьИменаКлючевыхРеквизитов(Версия = Неопределено) Экспорт
	
	МассивИмен = Новый Массив;
	
	Если Версия = 1 Тогда
		МассивИмен.Добавить("Документ");
		МассивИмен.Добавить("ДатаИсполнения");
		МассивИмен.Добавить("РезультатСогласования");
		МассивИмен.Добавить("Исполнитель");
		МассивИмен.Добавить("Наименование");
	Иначе
		МассивИмен.Добавить("Документ");
		МассивИмен.Добавить("ДатаИсполнения");
		МассивИмен.Добавить("РезультатСогласования");
		МассивИмен.Добавить("Исполнитель");
	КонецЕсли;
	
	Возврат МассивИмен;
	
КонецФункции

// Возвращает массив авторов виз по указанному документу
Функция ПолучитьМассивАвторовВизПоДокументу(Документ) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Исполнитель");
	Результат.Колонки.Добавить("ОсновнойОбъектАдресации");
	Результат.Колонки.Добавить("ДополнительныйОбъектАдресации");
	
	Выборка = РаботаСВизамиСогласования.ПолучитьАктивныеВизыДокумента(Документ);
	
	Для Каждого Элемент Из Выборка Цикл
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(Элемент, НоваяСтрока);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
